# CALIFICACIONES

In [2]:
import pandas as pd

In [40]:
tareas=pd.read_csv('../homework/HOMEWORK.csv').sort_values('ID').reset_index(drop=True)

In [41]:
tmp=tareas.drop(['ID'],axis=1)

In [44]:
tareas['TOTAL']=(tmp.sum(axis=1)/tmp.columns.size).round(2)

In [45]:
tareas

           ID  T1  T2  T3   T4  T5  T6  T7  T8  TOTAL
0  1032478036   5   5   5  4.5   5   5   5   5   4.94
1  1035441007   5   5   5  5.0   5   5   5   5   5.00
2  1038414799   5   5   5  4.6   5   5   4   5   4.82
3  1216730080   5   5   5  5.0   5   5   5   5   5.00

In [39]:
ex=pd.read_csv( 'exams.csv').sort_values('ID').reset_index(drop=True)
ex

           ID  Ex 1  Ex 2   Ex 3   Proyecto
0  1032478036   5.0   4.8    5.0          3
1  1035441007   5.0   4.0    4.0          5
2  1038414799   4.5   4.8    4.0          5
3  1216730080   4.5   4.5    4.5          5

In [48]:
ex['TAREAS']=tareas['TOTAL']
ex

           ID  Ex 1  Ex 2   Ex 3   Proyecto  TAREAS
0  1032478036   5.0   4.8    5.0          3    4.94
1  1035441007   5.0   4.0    4.0          5    5.00
2  1038414799   4.5   4.8    4.0          5    4.82
3  1216730080   4.5   4.5    4.5          5    5.00

In [50]:
tmp=ex.drop(['ID'],axis=1)
ex['TOTAL']=(tmp.sum(axis=1)/tmp.columns.size).round(2)

Calificaciones difinitivas

In [51]:
ex

           ID  Ex 1  Ex 2   Ex 3   Proyecto  TAREAS  TOTAL
0  1032478036   5.0   4.8    5.0          3    4.94   4.55
1  1035441007   5.0   4.0    4.0          5    5.00   4.60
2  1038414799   4.5   4.8    4.0          5    4.82   4.62
3  1216730080   4.5   4.5    4.5          5    5.00   4.70